In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [3]:
df1 = pd.read_excel(r"C:\Users\jhank\Desktop\DA7\Projects\budget-impact-jupyternb-python\data\test_scores\data_ACT-Data-by-District-2012-13.xlsx",header=1)

In [4]:
df1

,System,2013 Including Extended Time,2013 Standard Time Only,2012 Standard Time Only
0,State,19.048,19.3,19.184
1,ANDERSON SCHOOL DISTRICT,18.920,19.1,18.932
2,ALCOA CITY SCHOOLS,21.595,22.2,21.955
3,BEDFORD COUNTY SCHOOL DISTRICT,17.984,18.3,19.023
4,BENTON CO BOARD OF EDUCATION,18.376,19.2,19.358
...,...,...,...,...
115,WEAKLEY CO SCH DIST,19.462,20.1,20.076
116,WEST CARROLL SPECIAL SCH DIST,18.197,18.3,18.069
117,WHITE COUNTY SCHOOL DISTRICT,18.612,18.9,18.369
118,WILLIAMSON CO SCHOOLS,23.359,23.7,23.134
119,WILSON CO SCHLS BOE,19.898,20.2,19.896

2013 ACT

In [5]:
#df2014 = df4[(df4['District_Name'] == 'Davidson County')]
#df2014 = df2014[['SCHOOL_YEAR', 'K_8_Attendance_Rate_PCT', 'HS_Attendance_Rate_PCT']]
#df2014.rename(columns={'SCHOOL_YEAR' : 'year', 'K_8_Attendance_Rate_PCT' : 'k_8', 'HS_Attendance_Rate_PCT' : '9_12'},inplace=True)

In [6]:
df2013 = df1[df1['System']=='METRO NASHVILLE-DAVIDSON CO SD ']

In [7]:
df2013

,System,2013 Including Extended Time,2013 Standard Time Only,2012 Standard Time Only
77,METRO NASHVILLE-DAVIDSON CO SD,18.203,18.3,18.381

2014 ACT

In [8]:
df2 = pd.read_excel(r"C:\Users\jhank\Desktop\DA7\Projects\budget-impact-jupyternb-python\data\test_scores\data_ACT-Data-by-District-2013-14.xlsx", header=1)

In [9]:
df2

,System,2013 Including Extended Time,2013 Standard Time Only,2014 Including Extended Time
0,State,19.048,19.3,19.259
1,ANDERSON SCHOOL DISTRICT,18.92,19.1,19.33
2,ALCOA CITY SCHOOLS,21.595,22.2,21.291
3,BEDFORD COUNTY SCHOOL DISTRICT,17.984,18.3,18.446
4,BENTON CO BOARD OF EDUCATION,18.376,19.2,18.958
...,...,...,...,...
117,WEAKLEY CO SCH DIST,19.462,20.1,20.251
118,WEST CARROLL SPECIAL SCH DIST,18.197,18.3,18.773
119,WHITE COUNTY SCHOOL DISTRICT,18.612,18.9,18.621
120,WILLIAMSON CO SCHOOLS,23.359,23.7,23.515
121,WILSON CO SCHLS BOE,19.898,20.2,19.735

In [10]:
df2014 = df1[df1['System']=='METRO NASHVILLE-DAVIDSON CO SD ']

In [11]:
df2014

,System,2013 Including Extended Time,2013 Standard Time Only,2012 Standard Time Only
77,METRO NASHVILLE-DAVIDSON CO SD,18.203,18.3,18.381

2015 ACT

In [12]:
df3 = pd.read_excel(r"C:\Users\jhank\Desktop\DA7\Projects\budget-impact-jupyternb-python\data\test_scores\data_ACT-Data-by-District-2014-15.xlsx", header=1)

In [13]:
df3

,Unnamed: 0,Unnamed: 1,2014 Including Extended Time,2015 Including Extended Time
0,State,NaN,19.259,19.4
1,10,ANDERSON SCHOOL DISTRICT,19.330,19.9
2,12,OAK RIDGE SD,23.260,23.1
3,20,BEDFORD COUNTY SCHOOL DISTRICT,18.446,18.4
4,30,BENTON CO BOARD OF EDUCATION,18.958,18.4
...,...,...,...,...
121,920,WEAKLEY CO SCH DIST,20.251,19.7
122,930,WHITE COUNTY SCHOOL DISTRICT,18.621,18.7
123,940,WILLIAMSON CO SCHOOLS,23.515,23.8
124,950,WILSON CO SCHLS BOE,19.735,20.0
125,985,ACHIEVEMENT SCHOOL DISTRICT,NaN,14.2

In [14]:
df2015 = df3[df3['Unnamed: 1'] == 'METRO NASHVILLE-DAVIDSON CO SD ']

In [15]:
df2015

,Unnamed: 0,Unnamed: 1,2014 Including Extended Time,2015 Including Extended Time
29,190,METRO NASHVILLE-DAVIDSON CO SD,18.417,18.7

In [16]:
df2015.drop('Unnamed: 0', axis=1,inplace=True)

c:\Users\jhank\anaconda3\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [21]:
df2015 = df2015.T

In [23]:
df2015.reset_index()

                          index                               29
0                    Unnamed: 1  METRO NASHVILLE-DAVIDSON CO SD
1  2014 Including Extended Time                           18.417
2  2015 Including Extended Time                             18.7

In [26]:
df2015.rename(columns=['year',''],inplace=True)

In [27]:
df2015

                                                           29
Unnamed: 1                    METRO NASHVILLE-DAVIDSON CO SD
2014 Including Extended Time                           18.417
2015 Including Extended Time                             18.7